# StructuralConnectionCannotReplaceRefs Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StructuralConnectionFailures..::..StructuralConnectionCannotReplaceRefs Property
BuiltInFailures..::..StructuralConnectionFailures Class See Also
---
Structural Connection cannot replace elements
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId StructuralConnectionCannotReplaceRefs { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralConnectionCannotReplaceRefs As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ StructuralConnectionCannotReplaceRefs {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StructuralConnectionFailures Class
Autodesk.Revit.DB Namespace